backend/formulaSimulation/simulation-loadtest.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10 # 10 cereri pe secundă timp de 1 minut
scenarios:
  - flow:
      - post:
          url: "/api/simulation"
          json:
            team: "Mercedes"
            model: "W14"
            downforce: "mediu"s
            circuit: "Silverstone"
            weather: "soare"
            tires: "soft"